Below are examples of how to use different methods of the MysqlIO class:

In [1]:
import sys
sys.path.append('../code')
from mysql_io import MysqlIO

db = MysqlIO()

Connected to MySQL Server version 8.0.12
Your're connected to database: test

In [2]:
# Here is a testcase in leetcode, which is in the form of an dictionary
d_lc = {"headers":{"Prices":["product_id","start_date","end_date","price"],
                   "UnitsSold":["product_id","purchase_date","units"]},
        "rows":{"Prices":[[1,"2019-02-17","2019-02-28",5],
                          [1,"2019-03-01","2019-03-22",20],
                          [2,"2019-02-01","2019-02-20",15],
                          [2,"2019-02-21","2019-03-31",30]],
                "UnitsSold":[[1,"2019-02-25",100],
                             [1,"2019-03-01",15],
                             [2,"2019-02-10",200],
                             [2,"2019-03-22",30]]}}

In [3]:
# Specify the data type of each column accordingly and call the leetcode_to_table method
data_type = {'Prices': {'product_id': 'int',
                        'start_date': 'date',
                        'end_date': 'date',
                        'price': 'int'},
             'UnitsSold': {'product_id': 'int',
                           'purchase_date': 'date',
                           'units': 'int'}}
db.leetcode_to_table(d_lc, data_type)

In [4]:
# The two tables should be successfully added. Now lets call the table_to_df method to view them
db.table_to_df('Prices')

   product_id  start_date    end_date  price
0           1  2019-02-17  2019-02-28      5
1           1  2019-03-01  2019-03-22     20
2           2  2019-02-01  2019-02-20     15
3           2  2019-02-21  2019-03-31     30

In [5]:
db.table_to_df('UnitsSold')

   product_id purchase_date  units
0           1    2019-02-25    100
1           1    2019-03-01     15
2           2    2019-02-10    200
3           2    2019-03-22     30

In [6]:
# Try insert using pandas dataframe
import pandas as pd

d = {'a': {0: 1, 1: 2, 2: 3},
     'b': {0: 3, 1: 4, 2: 5},
     'c': {0: 5.0, 1: 6.0, 2: None},
     'd': {0: 'e', 1: 'f', 2: 'g'}}
df = pd.DataFrame(d)
df

   a  b    c  d
0  1  3  5.0  e
1  2  4  6.0  f
2  3  5  NaN  g

In [7]:
db.df_to_table(df, 'ttt', data_type='auto', replace=True)